[
    {
        "bookId": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/The_Great_Gatsby_Cover_1925_Retouched.jpg/800px-The_Great_Gatsby_Cover_1925_Retouched.jpg",
        "review": "A timeless tale of love, ambition, and the pursuit of the American Dream unfolds in F. Scott Fitzgerald's 'The Great Gatsby.' Set against the backdrop of the roaring twenties, this literary classic delves deep into the lives of Jay Gatsby, Daisy Buchanan, and Nick Carraway, weaving a narrative of opulence, longing, and disillusionment. Through vivid prose and captivating characters, Fitzgerald explores themes of wealth, class, and the fleeting nature of happiness, leaving readers enraptured by the glittering facade of the Jazz Age.",
        "totalPages": 180,
        "rating": 4.5,
        "category": "Classic Fiction",
        "tags": [
            "Romance",
            "Drama",
            "American Literature"
        ],
        "publisher": "Scribner",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 2,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://cdn.britannica.com/21/182021-050-666DB6B1/book-cover-To-Kill-a-Mockingbird-many-1961.jpg",
        "review": "Harper Lee's 'To Kill a Mockingbird' is a powerful narrative that grapples with the complexities of racial injustice and moral growth in the Deep South. Through the eyes of young Scout Finch, readers are transported to the fictional town of Maycomb, Alabama, where the trial of Tom Robinson unfolds, exposing the harsh realities of prejudice and discrimination. With its poignant portrayal of courage, empathy, and the search for truth, this timeless classic continues to resonate with readers as a poignant reminder of the enduring power of compassion and integrity.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Classic Fiction",
        "tags": [
            "Social Justice",
            "Coming-of-Age",
            "Southern Gothic"
        ],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 3,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://m.media-amazon.com/images/I/61NAx5pd6XL._AC_UF1000,1000_QL80_.jpg",
        "review": "In George Orwell's dystopian masterpiece '1984,' a chilling vision of a totalitarian society grips readers with its haunting portrayal of surveillance, propaganda, and the erosion of individual freedom. Set in a bleak future where Big Brother reigns supreme, Orwell's novel follows the journey of Winston Smith as he dares to defy the oppressive regime and seek truth amidst a world of lies. With its incisive commentary on politics, power, and the nature of reality, '1984' remains a stark warning against the dangers of unchecked authority and the relentless pursuit of control.",
        "totalPages": 328,
        "rating": 4.6,
        "category": "Dystopian Fiction",
        "tags": [
            "Political Satire",
            "Totalitarianism",
            "Surveillance State"
        ],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://m.media-amazon.com/images/I/71Q1tPupKjL._AC_UF1000,1000_QL80_.jpg",
        "review": "Jane Austen's 'Pride and Prejudice' sparkles with wit, romance, and social commentary as it navigates the intricacies of love, class, and societal expectations in Regency-era England. Through the spirited exchanges of Elizabeth Bennet and the enigmatic Mr. Darcy, Austen crafts a tale of misunderstandings, second chances, and the triumph of true love over prejudice. With its vibrant characters and timeless themes, 'Pride and Prejudice' continues to enchant readers with its irresistible blend of humor, charm, and enduring romance.",
        "totalPages": 279,
        "rating": 4.7,
        "category": "Classic Fiction",
        "tags": [
            "Romantic",
            "Regency Era",
            "British Literature"
        ],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 5,
        "bookName": "Harry Potter and the Sorcerer's Stone",
        "author": "J.K. Rowling",
        "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1598823299i/42844155.jpg",
        "review": "J.K. Rowling's 'Harry Potter and the Sorcerer's Stone' whisks readers away on a magical journey into a world of wonder and adventure. Follow the young wizard Harry Potter as he discovers his true heritage and embarks on a thrilling quest to uncover the secrets of his past. From the halls of Hogwarts School of Witchcraft and Wizardry to the depths of the Forbidden Forest, Rowling's enchanting tale delights readers with its captivating blend of magic, friendship, and the power of courage in the face of darkness.",
        "totalPages": 320,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": [
            "Magic",
            "Coming-of-Age",
            "Wizarding World"
        ],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 6,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://cdn.britannica.com/94/181394-050-2F76F7EE/Reproduction-cover-edition-The-Catcher-in-the.jpg",
        "review": "J.D. Salinger's 'The Catcher in the Rye' offers a poignant portrayal of teenage angst and alienation in post-war America. Through the eyes of the disillusioned protagonist Holden Caulfield, readers are immersed in a world of adolescent turmoil, existential crisis, and the search for authenticity in a society marked by phoniness and conformity. With its raw honesty and unflinching exploration of the human condition, 'The Catcher in the Rye' continues to resonate with readers of all generations as a timeless reflection on the challenges of adolescence and the quest for identity.",
        "totalPages": 224,
        "rating": 4.4,
        "category": "Classic Fiction",
        "tags": [
            "Coming-of-Age",
            "Existentialism",
            "Literature"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    }
]